app/controllers/users_controller.rb

 def create
   @user = User.create!(user_params)
---
INSERT INTO "users" ("usuario", "nombre", "apellido", "twitter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["usuario", "rlira"], ["nombre", "Ricardo"], ["apellido", "Lira"], ["twitter", "rllo"], ["created_at", 2017-03-31 17:54:55 UTC], ["updated_at", 2017-03-31 17:54:55 UTC]]

 def update
   @user.update(user_params)
---
UPDATE "users" SET "apellido" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["apellido", "rock"], ["updated_at", 2017-03-31 18:14:16 UTC], ["id", 1]]